Reports/КонверсияСМСРассылок.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.15">
	<Report>
		<Properties>
			<Name>КонверсияСМСРассылок</Name>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>ПолноеИмяФайла</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>256</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПериодОбработки</Name>
					<Type>
						<v8:Type>v8:StandardPeriod</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>ИсходныеДанныеИзФайла</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Телефон</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>13</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Отправлено</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>22</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>ПодготовленныеДанные</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Телефон</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>10</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Отправлено</Name>
							<Type>
								<v8:Type>xs:dateTime</v8:Type>
								<v8:DateQualifiers>
									<v8:DateFractions>DateTime</v8:DateFractions>
								</v8:DateQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>ТочкиЦелевые</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>ТочкаЦелевая</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ТочкиЦелевые</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>ОУ_Звонки</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Сигнатура</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>30</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Статус</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>128</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Абонент</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>15</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Report>
</MetaDataObject>

Reports/КонверсияСМСРассылок/Forms/ФормаОтчета/Ext/Form/Module.bsl
&НаКлиенте
Процедура Сформировать(Команда)
	
	Если Не ЗначениеЗаполнено(ЭтаФорма.Отчет.ПериодОбработки) Тогда
		Предупреждение("Не задан период обработки");
		Возврат;
	КонецЕсли;
	
	Если Не ЗначениеЗаполнено(ЭтаФорма.Отчет.ПолноеИмяФайла ) Тогда
		Предупреждение("Не задано имя файла");
		Возврат;
	КонецЕсли;
	
	ЭтаФорма.Отчет.ИсходныеДанныеИзФайла.Очистить();
	ЭтаФорма.Отчет.ПодготовленныеДанные.Очистить();

	Текст = Новый ТекстовыйДокумент();
	Текст.Прочитать(ЭтаФорма.Отчет.ПолноеИмяФайла);
	
	КоличествоСтрок = Текст.КоличествоСтрок();
	Если КоличествоСтрок<5 Тогда
		Предупреждение("Файл не содержит строк для обработки");
		Возврат
	КонецЕсли;
		
	// Загрузи исходные данные
	//------------------------
	Для i=5 По КоличествоСтрок Цикл
		
		Стр = Текст.ПолучитьСтроку(i);
		Мас = СтрРазделить(Стр, ";");
		
		Если Мас.Количество()<3 Тогда
			Продолжить;
		КонецЕсли;
		
		Тел 	= Мас[2];
		Отпр 	= Мас[5];
				
		Новая = ЭтаФорма.Отчет.ИсходныеДанныеИзФайла.Добавить();
		Новая.Телефон 		= Тел;
		Новая.Отправлено 	= Отпр;
	КонецЦикла;
	
		
	Если ЭтаФорма.Отчет.ИсходныеДанныеИзФайла.Количество()=0
	Тогда
		Предупреждение("Не найдены телефоны в файле");
		Возврат
	КонецЕсли;
	
	//Подготовь данные
	//----------------
	Отбор = Новый Структура();
	
	Для Каждого Стр Из ЭтаФорма.Отчет.ИсходныеДанныеИзФайла Цикл
		
		Тел = Стр.Телефон;
		
		//Удали кавычки
		//--------------
		Тел = СтрЗаменить(Тел, Символ(34), "");
		
		Если СтрДлина(Тел)<>11 Тогда
			//Сообщить("Отбросили номер телефона "+Тел+", из-за неверной длины" );
			Сооб = Новый СообщениеПользователю();
			Сооб.Текст = "Отбросили номер телефона "+Тел+", из-за неверной длины";  
			Сооб.Сообщить();
			Продолжить;
		КонецЕсли;
		
		//Отбрось лидирующую цифру "7"
		//----------------------------
		Тел = Прав(Тел,10);

		Отпр = Стр.Отправлено;
		Отпр = СтрЗаменить(Отпр, Символ(34), "");
		
		Попытка
			Отправлено = Дата(Отпр)
		Исключение
			//Сообщить("Ошибка преобразования к дате:" + Отпр+ " удаляем из анализа телефон "+Тел);			
			Сооб = Новый СообщениеПользователю();
			Сооб.Текст = "Удаляем из анализа строку с телефоном   "+Тел+"    - ошибка преобразования даты";  
			Сооб.Сообщить();
			Продолжить;
		КонецПопытки;
		
		Отбор.Вставить("Телефон", Тел);
		Найдено = ЭтаФорма.Отчет.ПодготовленныеДанные.НайтиСтроки(Отбор);
		Если Найдено.Количество()>0 Тогда
			//Сообщить("Дубль телефона: "+Тел+ ", удаляем");
			Сооб = Новый СообщениеПользователю();
			Сооб.Текст = "Дубль телефона: "+Тел+ ", удаляем";  
			Сооб.Сообщить();
			Продолжить
		КонецЕсли;
		
		Новая = ЭтаФорма.Отчет.ПодготовленныеДанные.Добавить();
		Новая.Телефон 		= Тел;
		Новая.Отправлено 	= Отправлено;
	КонецЦикла;
	
	Если ЭтаФорма.Отчет.ПодготовленныеДанные.Количество()=0 Тогда
		Сообщить("Нет подготовленных данных для анализа");
		Возврат
	КонецЕсли;

	 СформироватьНаСервере();
КонецПроцедуры

&НаСервере
Процедура СформироватьНаСервере()
	
	ЭтаФорма.Результат.Очистить();
	
	Об = РеквизитФормыВЗначение("Отчет");
	Об.СкомпоноватьРезультат(ЭтаФорма.Результат);
	ЗначениеВРеквизитФормы(Об, "Отчет");

КонецПроцедуры

&НаКлиенте
Процедура ПолноеИмяФайлаНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	ЭтаФорма.Отчет.ПолноеИмяФайла = ОбработатьНачалоВыбораФайла(СтандартнаяОбработка);
КонецПроцедуры

&НаКлиенте
Функция ОбработатьНачалоВыбораФайла(СтандартнаяОбработка)
	
	ПолноеИмя = "";
	
	СтандартнаяОбработка = Ложь;
	РежимДиалога = РежимДиалогаВыбораФайла.Открытие;
	ДиалогВыбораФайла = Новый ДиалогВыбораФайла(РежимДиалога);
	ДиалогВыбораФайла.ПроверятьСуществованиеФайла=Истина;
	ДиалогВыбораФайла.МножественныйВыбор = Ложь;
	ДиалогВыбораФайла.Заголовок = Нстр("ru = 'Задайте имя файла выгрузки'");
	ДиалогВыбораФайла.ПолноеИмяФайла = "";
	
	ДиалогВыбораФайла.Фильтр = "Формат выгрузки(*.csv)|*.csv|Все файлы (*.*)|*.*";
	Если ДиалогВыбораФайла.Выбрать() Тогда
		ПолноеИмя = ДиалогВыбораФайла.ПолноеИмяФайла;
	КонецЕсли;
	
	Возврат ПолноеИмя
	
КонецФункции

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	ЭтаФорма.Результат.Скрыть();
	УстановиЦелевыеТочки();
	//Если ЭтаФорма.Отчет.ТочкиЦелевые.Количество()>0 Тогда
	//	ЭтаФорма.Элементы.ТочкиЦелевые.Доступность=Ложь;
	//КонецЕсли;
КонецПроцедуры

&НаСервере
Процедура УстановиЦелевыеТочки()
	Об = РеквизитФормыВЗначение("Отчет");
	Об.ДоступныеЦелевыеОчередиУстанови();
	ЗначениеВРеквизитФормы(Об, "Отчет");
КонецПроцедуры
